# #13: Konversi nilai numerik ke dalam sejumlah kategori

## Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [7]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    35
1    60
2    67
3    40
4    77
5     5
6    30
7    56
8    72
9    76

## Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan `cut()`

In [10]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    35        dewasa
1    60        dewasa
2    67        manula
3    40        dewasa
4    77        manula
5     5          anak
6    30        dewasa
7    56        dewasa
8    72        manula
9    76        manula